In [3]:
import pandas as pd
import numpy as np

In [5]:
df = pd.read_parquet(r"D:\Project\data nyc fare data\train.parquet")
df.head()

,key,fare_amount,pickup_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count,date
0,2009-06-15 17:26:21.0000001,4.5,2009-06-15 17:26:21,-73.844311,40.721319,-73.841610,40.712278,1,2009-06-15
1,2010-01-05 16:52:16.0000002,16.9,2010-01-05 16:52:16,-74.016048,40.711303,-73.979268,40.782004,1,2010-01-05
2,2011-08-18 00:35:00.00000049,5.7,2011-08-18 00:35:00,-73.982738,40.761270,-73.991242,40.750562,2,2011-08-18
3,2012-04-21 04:30:42.0000001,7.7,2012-04-21 04:30:42,-73.987130,40.733143,-73.991567,40.758092,1,2012-04-21
4,2010-03-09 07:51:00.000000135,5.3,2010-03-09 07:51:00,-73.968095,40.768008,-73.956655,40.783762,1,2010-03-09

In [9]:
df.drop(columns='key',inplace=True)

In [10]:
df.shape

(55423856, 8)

In [14]:
df.describe()

,fare_amount,pickup_datetime,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,passenger_count
count,5.542386e+07,55423856,5.542386e+07,5.542386e+07,5.542348e+07,5.542348e+07,5.542386e+07
mean,1.134505e+01,2012-03-21 00:18:49.821667,-7.250968e+01,3.991979e+01,-7.251121e+01,3.992068e+01,1.685380e+00
min,-3.000000e+02,2009-01-01 00:00:27,-3.442060e+03,-3.492264e+03,-3.442025e+03,-3.547887e+03,0.000000e+00
25%,6.000000e+00,2010-08-19 21:09:08.750000,-7.399207e+01,4.073493e+01,-7.399140e+01,4.073403e+01,1.000000e+00
50%,8.500000e+00,2012-03-19 11:39:24.500000,-7.398180e+01,4.075265e+01,-7.398015e+01,4.075316e+01,1.000000e+00
75%,1.250000e+01,2013-10-18 17:27:55.500000,-7.396708e+01,4.076713e+01,-7.396367e+01,4.076810e+01,2.000000e+00
max,9.396336e+04,2015-06-30 23:59:54,3.457626e+03,3.408790e+03,3.457622e+03,3.537133e+03,2.080000e+02
std,2.071083e+01,NaN,1.284888e+01,9.642353e+00,1.278220e+01,9.633346e+00,1.327664e+00

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 55423856 entries, 0 to 55423855
Data columns (total 8 columns):
 #   Column             Dtype
---  ------             -----
 0   fare_amount        float64
 1   pickup_datetime    datetime64[us]
 2   pickup_longitude   float64
 3   pickup_latitude    float64
 4   dropoff_longitude  float64
 5   dropoff_latitude   float64
 6   passenger_count    int64
 7   date               object
dtypes: datetime64[us](1), float64(5), int64(1), object(1)
memory usage: 3.3+ GB

In [11]:
df.isnull().sum()

fare_amount            0
pickup_datetime        0
pickup_longitude       0
pickup_latitude        0
dropoff_longitude    376
dropoff_latitude     376
passenger_count        0
date                   0
dtype: int64

In [12]:
df.columns

Index(['fare_amount', 'pickup_datetime', 'pickup_longitude', 'pickup_latitude',
       'dropoff_longitude', 'dropoff_latitude', 'passenger_count', 'date'],
      dtype='object')

In [16]:
df['time_pickup'] = df['pickup_datetime'].dt.time
df['time_pickup']

0           17:26:21
1           16:52:16
2           00:35:00
3           04:30:42
4           07:51:00
              ...
55423851    03:28:00
55423852    20:46:20
55423853    22:04:24
55423854    05:57:51
55423855    11:33:00
Name: time_pickup, Length: 55423856, dtype: object

In [17]:
df['hour_pickup'] = df['pickup_datetime'].dt.hour
df['hour_pickup']

0           17
1           16
2            0
3            4
4            7
            ..
55423851     3
55423852    20
55423853    22
55423854     5
55423855    11
Name: hour_pickup, Length: 55423856, dtype: int32